# Задача 1
a = 2
b = 0.5
print(a+b)

# Задача 2
name = 'МАКСИМ'
print(name)

# Задача 3
#v = input('Введите число от 1 до 10: ')
# print(int(v)+10)

# Задача 4
#name = input('Введите Ваше имя: ')
#print(f'Привет, {name}! Как дела?')

# Задача 5
print(float('1'))

try:
    print(int('2.5'))
except ValueError:
    print('неверный тип данных')  # ошибка по типу

print(bool(1))
print(bool(''))
print(bool(0))
